[
  {
    "name": "Engineering Expertise",
    "tree": "Mechanical Knowledge",
    "level": 1,
    "description": "Ask questions pertaining to mechanical and engineering topics.",
    "effect": "The pilot can ask the Mediator two questions about mechanical and engineering topics, and they must answer truthfully. This ability can also be used to ask for the full stats of any Mech Chassis, System, Module, or Pilot Equipment that the pilot can see and interact with.",
    "apCost": 1,
    "actionType": "Turn"
  },
  {
    "name": "Talk Shop",
    "tree": "Mechanical Knowledge",
    "level": 2,
    "description": "Build rapport, and ask favours of other mechanics, salvagers, and workers.",
    "effect": "Detailed effect of Talk Shop.",
    "apCost": 3,
    "actionType": "Turn"
  },
  {
    "name": "Mech Acquisition",
    "tree": "Mechanical Knowledge",
    "level": 3,
    "description": "Track down and acquire specific Mech parts and Chassis.",
    "effect": "You are able to use your intimate knowledge of engineering to track down and acquire specific Mech parts within wasteland settlements and trading hubs.",
    "apCost": 2,
    "actionType": "Long"
  },
  {
    "name": "Mass Field Maintenance",
    "tree": "Mech-Tech",
    "level": 1,
    "description": "Repair 4 SP on target Mechs or Vehicles in the field.",
    "effect": "For each Ability Point you spend when you activate this Ability you restore up to 4 SP amongst any number of target Mechs or Vehicles within Range, as long as they have at least 1 SP.",
    "apCost": "Variable",
    "range": "Close",
    "actionType": "Long"
  },
  {
    "name": "If I cut this wire...",
    "tree": "Mech-Tech",
    "level": 2,
    "description": "Damage Systems and Modules on target Mech.",
    "effect": "You can work out exactly where to target a Mech in order to disable its Systems or Modules.",
    "apCost": 2,
    "range": "Close",
    "actionType": "Turn"
  },
  {
    "name": "Mass Field Repair",
    "tree": "Mech-Tech",
    "level": 3,
    "description": "Repair target Systems and Modules in the field.",
    "effect": "You repair any number of damaged Mech Chassis, Vehicles, Systems, or Modules within Range to Intact Condition.",
    "apCost": "Variable",
    "range": "Close",
    "actionType": "Long"
  },
  {
    "name": "Jury Rig",
    "tree": "Forging",
    "level": 1,
    "description": "Craft improvised equipment from everyday items.",
    "effect": "You are able to hastily craft improvised equipment from everyday objects taken from your surroundings.",
    "apCost": 2,
    "actionType": "Turn"
  },
  {
    "name": "Mech-Gyver",
    "tree": "Forging",
    "level": 2,
    "description": "Craft Mech Systems and Modules from Scrap in the field.",
    "effect": "Your ability to improvise extends to being able to craft mech parts from scrap in the field.",
    "apCost": 3,
    "actionType": "Short"
  },
  {
    "name": "Auto-Turret",
    "tree": "Forging",
    "level": 3,
    "description": "Construct an Immobile Auto-Turret that can be fitted with Systems and Modules.",
    "effect": "You construct an immobile Auto-Turret and train yourself in using it.",
    "apCost": 3,
    "actionType": "Turn",
    "traits": [
      {
        "type": "pilot equipment"
      }
    ]
  },
  {
    "name": "Union Engineer",
    "tree": "Advanced Engineer",
    "level": 1,
    "description": "Improved repair; gain an additional 4SP when using Repair abilities or Systems.",
    "effect": "You have specialised in getting your hands dirty, you can patch up even the most brutally damaged Mechs with ease, even in the midst of conflict.",
    "apCost": 1,
    "actionType": "Passive"
  },
  {
    "name": "This one goes to 11...",
    "tree": "Advanced Engineer",
    "level": 2,
    "description": "Overcharge a Reactor beyond it’s initial capacity to gain additional Pushes.",
    "effect": "You are able to overcharge a Mech Reactor far beyond its usual capacity.",
    "apCost": 3,
    "range": "Close",
    "actionType": "Short"
  },
  {
    "name": "Mass Energy Recharge",
    "tree": "Advanced Engineer",
    "level": 3,
    "description": "Restore 10 Energy Points to target Mechs in the field.",
    "effect": "You have gained mastery and intimate knowledge of how a Mech reactor performs, to the point you are able to recharge limited amounts of their energy in the field.",
    "apCost": 4,
    "range": "Close",
    "actionType": "Long"
  },
  {
    "name": "Tip Top Shape",
    "tree": "Legendary Engineer",
    "level": 1,
    "description": "Your Union Crawler no longer needs to pay upkeep and does not deteriorate.",
    "effect": "You have learned every inch of your Union Crawler, and know it better than the back of your own hand.",
    "actionType": "Passive"
  },
  {
    "name": "The Full Works",
    "tree": "Legendary Engineer",
    "level": 1,
    "description": "Fully repair and restore a target Mech and all attached Systems and Modules.",
    "effect": "Your engineering abilities are unparalleled, you can take apart and put back together a Mech at an incredible speed, repairing any faults or issues that may exist within its behemoth Chassis.",
    "apCost": 3,
    "range": "Close",
    "actionType": "Long"
  },
  {
    "name": "Hacking Kit",
    "tree": "Hacking",
    "level": 1,
    "description": "Versatile tool for allowing Mech Module hacks on foot and vice-versa.",
    "effect": "You acquire and train in the use of a Hacking Kit that only you can use.",
    "traits": [
      {
        "type": "pilot equipment"
      },
      {
        "type": "hacking"
      }
    ]
  },
  {
    "name": "System and Software Hacker",
    "tree": "Hacking",
    "level": 2,
    "description": "Attempt to destroy Systems and Modules on target Mech.",
    "effect": "You attempt to hack into a System or Module in order to disable, damage, or destroy it in some way.",
    "apCost": 2,
    "range": "Medium",
    "actionType": "Turn",
    "traits": [
      {
        "type": "hacking"
      }
    ],
    "rollTable": {
      "20": "The System or Module is destroyed.",
      "11-19": "The System or Module is damaged.",
      "6-10": "The System or Module is inoperable and cannot be used until the end of the next turn.",
      "2-5": "The hacking attempt fails.",
      "1": "The hacking attempt fails and the target cannot be targeted by any Abilities with the Hacking Trait for the next 10 minutes."
    }
  },
  {
    "name": "Denial of Service Attack",
    "tree": "Hacking",
    "level": 3,
    "description": "Attempt to Shutdown target Mech in Range.",
    "effect": "This allows you to flood any number of Mechs or Vehicles in Close Range with numerous false signals, overwhelming them with so much information that they temporarily Shutdown. This costs 1 AP per Mech or Vehicle you target",
    "apCost": "Variable",
    "range": "Medium",
    "actionType": "Turn",
    "traits": [
      {
        "type": "hacking"
      }
    ],
    "rollTable": {
      "20": "All targets Shutdown for 10 minutes.",
      "11-19": "All targets Shutdown for one round. They are active again at the end of their next turn.",
      "6-10": "All targets must choose to either move or take an action during its next turn.",
      "2-5": "The hacking attempt fails.",
      "1": "All Mechs within Close Range of your Mech Shutdown for 10 minutes. This includes your Mech and those of any allies."
    }
  },
  {
    "name": "Well actually...",
    "tree": "Electronics",
    "level": 1,
    "description": "Ask questions about Systems, Modules, or Technology.",
    "effect": "You can casually answer questions about Systems, Modules, Mechs, or technology even if you do not actually know the answer.",
    "apCost": 1,
    "actionType": "Turn",
    "rollTable": {
      "20": "You can ask the Mediator five questions about it and they must give you true answers.",
      "11-19": "You can ask the Mediator three questions about it and they must give you true answers.",
      "6-10": "You can ask the Mediator two questions about it. One of these answers must be true, but the other can be false.",
      "2-5": "You do not actually know, and must make up a convincing answer to save your pride.",
      "1": "You do not know the answer, and everyone realises this."
    }
  },
  {
    "name": "Techno Babble",
    "tree": "Electronics",
    "level": 2,
    "description": "Build rapport and ask favours of other Hackers and technophiles.",
    "effect": "You can effortlessly enunciate a stream of esoteric and mostly incomprehensible thoughts about technology.",
    "apCost": 2,
    "actionType": "Turn"
  },
  {
    "name": "Holo Companion",
    "tree": "Electronics",
    "level": 3,
    "description": "Construct an intelligent, holographic A.I. companion, projected from a device on your person.",
    "effect": "You have created an intelligent, holographic, A.I. companion that only you can use.",
    "traits": [
      {
        "type": "pilot equipment"
      }
    ]
  },
  {
    "name": "Bionic Senses",
    "tree": "Augmentation",
    "level": 1,
    "description": "Gain integrated Thermal Optics, Zoom Optics, or IR Night Vision Optics.",
    "effect": "You gain your choice of integrated Thermal Optics, Zoom Optics, or IR Night Vision Optics.",
    "actionType": "Passive"
  },
  {
    "name": "Bionic Arms",
    "tree": "Augmentation",
    "level": 2,
    "description": "Gain a set of integrated Bionic Arms. Gives an improved base attack.",
    "effect": "You gain a set of bionic arms, surgically installed to any specification you desire.",
    "actionType": "Passive"
  },
  {
    "name": "Bionic Legs",
    "tree": "Augmentation",
    "level": 3,
    "description": "Gain a set of integrated Bionic Legs. Gives improved base movement.",
    "effect": "You gain a set of bionic legs, surgically installed to any specification you desire.",
    "actionType": "Passive"
  },
  {
    "name": "Trojan Horse",
    "tree": "Advanced Hacking",
    "level": 1,
    "description": "Gain control of a Mech in Range as if it were yours for 10 minutes.",
    "effect": "You have learned how to hack into the root control systems of a Mech in order to pwn them.",
    "apCost": 4,
    "range": "Medium",
    "actionType": "Turn",
    "traits": [
      {
        "type": "hacking"
      }
    ]
  },
  {
    "name": "Counter-Hacking",
    "tree": "Advanced Hacking",
    "level": 2,
    "description": "Attempt to use an Ability with the Hacking Trait as a Reaction to being hacked.",
    "effect": "Your firewalls are bristling with multiple worms which can create backdoors directly into an opposing hacker’s Systems.",
    "apCost": 1,
    "range": "Medium",
    "actionType": "Reaction",
    "traits": [
      {
        "type": "hacking"
      }
    ],
    "rollTable": {
      "20": "You stop the hacking attempt. In addition, you can activate any of your Abilities with the Hacking Trait in response as a Reaction, without paying their EP or AP cost.",
      "11-19": "You stop the hacking attempt. In addition, you can activate any of your Abilities with the Hacking Trait in response as a Reaction.",
      "6-10": "You can choose to stop the hacking attempt, or activate one of your Abilities with the Hacking Trait in response.",
      "2-5": "Your counter hacking attempt fails",
      "1": "Your counter hacking attempt fails, and the opposing hacker can activate any Ability with the Hacking Trait in response to your attempt."
    }
  },
  {
    "name": "Worm",
    "tree": "Advanced Hacking",
    "level": 3,
    "description": "Hack multiple Mechs in Range with a complex worm virus.",
    "effect": "You have programmed a complex worm virus that can traverse through a network of multiple Mechs, causing havoc and chaos amongst their installed Systems and Modules, and even potentially disabling their Chassis entirely.",
    "apCost": "Variable",
    "range": "Medium",
    "actionType": "Turn",
    "traits": [
      {
        "type": "hacking"
      }
    ],
    "rollTable": {
      "20": "The Chassis of all targeted Mechs is damaged and inoperable until repaired.",
      "11-19": "A System and Module of your choice on each Mech is damaged.",
      "6-10": "A System or Module of your choice on each Mech is damaged.",
      "2-5": "A System or Module on one targeted Mech of your choice is damaged.",
      "1": "The Worm fails to upload to the targets and has no effect."
    }
  },
  {
    "name": "Network Takeover",
    "tree": "Legendary Hacker",
    "level": 1,
    "description": "Hack the entire network of a settlement in range. Control it as you wish.",
    "effect": "You no longer even see the code, you simply see, corpo, construction mech, redhead, base defences.",
    "apCost": 5,
    "range": "Far",
    "actionType": "Turn",
    "traits": [
      {
        "type": "hacking"
      }
    ]
  },
  {
    "name": "Spyware",
    "tree": "Legendary Hacker",
    "level": 1,
    "description": "Permanent and undetectable spyware you can install on a settlement’s network.",
    "effect": "You have developed advanced Spyware which is able to access confidential information from an entire settlement and permanently spy upon them.",
    "apCost": 5,
    "range": "Far",
    "actionType": "Turn",
    "traits": [
      {
        "type": "hacking"
      }
    ]
  },
  {
    "name": "Squeeze it in",
    "tree": "Salvaging",
    "level": 1,
    "description": "Temporariliy increase the cargo capacity of a Mech.",
    "effect": "You always find a way to squeeze that last bit of cargo into a Mech.",
    "apCost": 1,
    "range": "Close",
    "actionType": "Turn"
  },
  {
    "name": "Expert Salvager",
    "tree": "Salvaging",
    "level": 2,
    "description": "Gain additional salvage when Area Salvaging. Bypass the die roll when salvaging a Mech.",
    "effect": "You are a dab hand at scouring the wastes for every piece of salvage.",
    "actionType": "Passive"
  },
  {
    "name": "Emergency Salvage Drop",
    "tree": "Salvaging",
    "level": 3,
    "description": "Retrieve Chassis, Systems, Modules, Scrap, and Equipment from your Crawler.",
    "effect": "You can call in an emergency salvage drop that deploys from your Union Crawler.",
    "apCost": 3,
    "actionType": "Short"
  },
  {
    "name": "Read a Person",
    "tree": "Trading",
    "level": 1,
    "description": "Learn information about an NPC you’re conversing with.",
    "effect": "You have a knack for being able to read people during a conversation.",
    "apCost": 1,
    "actionType": "Turn"
  },
  {
    "name": "Let’s Make a Deal",
    "tree": "Trading",
    "level": 2,
    "description": "Attempt to force a deal through on your terms using leverage.",
    "effect": "You have a knack for being able to make a deal with the staunchest and most hard nosed folk, even in dire situations.",
    "apCost": 1,
    "actionType": "Turn",
    "rollTable": {
      "20": "The deal is accepted and you may ask for an additional request.",
      "11-19": "The deal is accepted based on your leverage.",
      "6-10": "The deal is accepted, but you must offer your leverage now. If it was scrap they want the payment in advance, if it was a threat you have to follow through on the threat immediately, if it was your reputation you must find a way to flex it now.",
      "2-5": "The deal is rejected.",
      "1": "The deal is rejected and the people you are making a deal with become hostile to you and cannot be negotiated with further."
    }
  },
  {
    "name": "No Job Too Big",
    "tree": "Leadership",
    "level": 3,
    "description": "When reduced to 0 HP or your Mech is reduced to 0 SP, take a Turn Action or Reaction.",
    "effect": "You summon all your reserves in the face of death to finish what you started.",
    "apCost": 2,
    "actionType": "Reaction"
  },
  {
    "name": "Folk Song",
    "tree": "Leadership",
    "level": 1,
    "description": "Sing a song to set a mood for an audience of NPCs.",
    "effect": "You sing a song that kindles strong feelings in NPCs nearby.",
    "apCost": 1,
    "actionType": "Turn"
  },
  {
    "name": "Behemoth",
    "tree": "Leadership",
    "level": 2,
    "description": "Intimidate opponents and force them to accept your demands or flee.",
    "effect": "You strike fear into the hearts of any number of targets within Range.",
    "apCost": 2,
    "range": "Medium",
    "actionType": "Turn",
    "rollTable": {
      "20": "They flee from you or acquiesce to your demands. You may choose which and may demand something in addition to what you originally requested.",
      "11-19": "They flee from you or acquiesce to your demands.",
      "6-10": "They flee from you, but barricade themselves in or alert something stronger to your presence.",
      "2-5": "They stand strong in the face of you, ready to fight, and do not retreat or acquiesce.",
      "1": "They stand strong in the face of you, and are much stronger than you thought. The Mediator may add reinforcements to their numbers, or improve their strength or capabilities in some other way."
    }
  },
  {
    "name": "Valiant Speech",
    "tree": "Leadership",
    "level": 3,
    "description": "Inspire you allies with a rousing speech which heals and provides them with bonuses.",
    "effect": "You inspire your Allies with a rousing speech.",
    "apCost": 3,
    "actionType": "Short"
  },
  {
    "name": "Beefcake",
    "tree": "Advanced Hauler",
    "level": 1,
    "description": "Increase your size and strength, as well as the size and strength of your Mech.",
    "effect": "Bigger is always better.",
    "actionType": "Passive"
  },
  {
    "name": "Mechapult Master",
    "tree": "Advanced Hauler",
    "level": 2,
    "description": "Improve your ability with the Mechapult System.",
    "effect": "You have become a master of the sacred art of scrap flinging, making you highly versed at using the Mechapult System.",
    "apCost": 1,
    "actionType": "Free"
  },
  {
    "name": "Can’t Stop, Won’t Stop",
    "tree": "Advanced Hauler",
    "level": 3,
    "description": "Gain a special charge attack. Damage is based on cargo carried.",
    "effect": "You have learned to use the momentum and bulk of the vast weight of cargo you can carry to crush your enemies and see them driven before you.",
    "apCost": 3,
    "range": "Medium",
    "actionType": "Turn",
    "traits": [
      {
        "type": "melee"
      }
    ]
  },
  {
    "name": "Master Salvager",
    "tree": "Legendary Hauler",
    "level": 1,
    "description": "Restore destroyed Systems Modules, and Mechs to Damaged Condition.",
    "effect": "You are able to take things that are long broken and make them whole again.",
    "apCost": 2,
    "range": "Close",
    "actionType": "Short"
  },
  {
    "name": "Hauling All Day",
    "tree": "Legendary Hauler",
    "level": 1,
    "description": "Any Mech that you Pilot doubles its Structure Points and Cargo Capacity.",
    "effect": "You’ve been there, seen it all, and can take on just about anything thrown at you.",
    "actionType": "Passive"
  },
  {
    "name": "Gather Intelligence",
    "tree": "Recon",
    "level": 1,
    "description": "Ask two questions about an area and recieve truthful answers.",
    "effect": "You safely investigate an area to gather information about it.",
    "apCost": 2,
    "actionType": "Short"
  },
  {
    "name": "Tail",
    "tree": "Recon",
    "level": 2,
    "description": "Track a target without being seen.",
    "effect": "You are able to track and tail targets with expert skill.",
    "apCost": 2,
    "range": "Long",
    "actionType": "Turn"
  },
  {
    "name": "Survey Drone",
    "tree": "Recon",
    "level": 3,
    "description": "Gain a Survey Drone that can be equipped with Systems and Modules.",
    "effect": "You acquire and train in the use of a Survey Drone and Drone Controller that only you can use.",
    "traits": [
      {
        "type": "pilot equipment"
      }
    ]
  },
  {
    "name": "Silver Tongue",
    "tree": "Sleuth",
    "level": 1,
    "description": "Glean what motivates an NPC and use it to convince them to do as you wish.",
    "effect": "When you are in conversation with someone, you may appeal to something that motivates them in order to convince them to do something you want.",
    "apCost": 1,
    "actionType": "Turn"
  },
  {
    "name": "Forked Tongue",
    "tree": "Sleuth",
    "level": 2,
    "description": "Lie with confidence and great skill to fool even the most insightful.",
    "effect": "You are able to weave tall and grandiose tales that can fool even the most wary, cynical, or insightful of wastelanders.",
    "apCost": 1,
    "actionType": "Turn"
  },
  {
    "name": "Persona",
    "tree": "Sleuth",
    "level": 3,
    "description": "Disguise yourself and create a false identity.",
    "effect": "You carefully prepare a convincing alternate identity.",
    "apCost": "Variable",
    "actionType": "Long"
  },
  {
    "name": "You Shot First",
    "tree": "Sniper",
    "level": 1,
    "description": "Activate this to act first whenever initiative would be rolled.",
    "effect": "You have a knack for being the first to act in an altercation.",
    "apCost": 2,
    "actionType": "Free"
  },
  {
    "name": "Spotter",
    "tree": "Sniper",
    "level": 2,
    "description": "Chooose a target in range for an ally to make a free attack against.",
    "effect": "You are able to identify targets and coordinate attacks against them with your allies.",
    "apCost": 2,
    "range": "Medium",
    "actionType": "Free"
  },
  {
    "name": "Custom Sniper Rifle",
    "tree": "Sniper",
    "level": 3,
    "description": "Gain a specialised sniper rifle that only you can use.",
    "effect": "You acquire and train in the use of a Custom Sniper Rifle that only you can use.",
    "traits": [
      {
        "type": "pilot equipment"
      }
    ]
  },
  {
    "name": "Flashback",
    "tree": "Advanced Scout",
    "level": 1,
    "description": "Activate to retroactively have a solution in place for the current situation.",
    "effect": "You have a knack for preparing for situations in advance, allowing you to get out of all sorts of binds.",
    "apCost": 3,
    "actionType": "Reaction"
  },
  {
    "name": "Camo Suit",
    "tree": "Advanced Scout",
    "level": 2,
    "description": "Gain the use of an advanced Camo Suit that will make you invisible for short periods of time.",
    "effect": "You acquire and train in the use of a specialised Camo Suit that only you can use.",
    "apCost": 3,
    "actionType": "Turn",
    "traits": [
      {
        "type": "pilot equipment"
      },
      {
        "type": "armor"
      }
    ]
  },
  {
    "name": "Wingsuit",
    "tree": "Advanced Scout",
    "level": 3,
    "description": "Gain a Wingsuit which allows you to fly.",
    "effect": "You acquire and train in the use of a Wingsuit that only you can use.",
    "apCost": 1,
    "traits": [
      {
        "type": "pilot equipment"
      },
      {
        "type": "armor"
      }
    ]
  },
  {
    "name": "Wasteland Celebrity",
    "tree": "Legendary Scout",
    "level": 1,
    "description": "You are known and respected everywhere and can get assistance when required.",
    "effect": "Your presence is now respected by people everywhere.",
    "apCost": 2,
    "actionType": "Turn"
  },
  {
    "name": "Teleport Beacon",
    "tree": "Legendary Scout",
    "level": 1,
    "description": "Gain a beacon and controller. Activate the controller to be teleported to the beacon.",
    "effect": "You acquire and train in the use of a Teleport Beacon that only you can use.",
    "apCost": 2,
    "actionType": "Turn",
    "traits": [
      {
        "type": "pilot equipment"
      }
    ]
  },
  {
    "name": "Charge",
    "tree": "Gladitorial Combat",
    "level": 1,
    "description": "Charge a target within Range and make a Melee attack with bonus damage.",
    "effect": "You charge a target in Range, moving to Close Range of them.",
    "apCost": 1,
    "range": "Medium",
    "actionType": "Free"
  },
  {
    "name": "Overpower",
    "tree": "Gladitorial Combat",
    "level": 2,
    "description": "Put and hold a target in a compromised position so that they gain the Vulnerable Trait.",
    "effect": "You overpower a target creature.",
    "apCost": 2,
    "range": "Close",
    "actionType": "Turn"
  },
  {
    "name": "Duel",
    "tree": "Gladitorial Combat",
    "level": 3,
    "description": "Compel a target in Range to fight you in single combat.",
    "effect": "You compel a creature in Range to fight you in single combat.",
    "apCost": 3,
    "range": "Close",
    "actionType": "Turn"
  },
  {
    "name": "Wastelander Rapport",
    "tree": "Survivalist",
    "level": 1,
    "description": "Ask questions of locals and gain assistance when required.",
    "effect": "You have an affinity with the people of the wastes.",
    "apCost": 1,
    "actionType": "Turn"
  },
  {
    "name": "Resourceful",
    "tree": "Survivalist",
    "level": 2,
    "description": "Find resources in the wastes and limit the effects of environmental conditions.",
    "effect": "You are hardened to surviving out in the wastelands.",
    "apCost": 1,
    "actionType": "Short"
  },
  {
    "name": "Custom Missile Launcher",
    "tree": "Survivalist",
    "level": 3,
    "description": "Gain a specialised Missile Launcher that only you can use.",
    "effect": "You acquire and train in the use of a Custom Missile Launcher that only you can use.",
    "traits": [
      {
        "type": "pilot equipment"
      }
    ]
  },
  {
    "name": "Provoke",
    "tree": "Tactical Warfare",
    "level": 1,
    "description": "Taunt a target in Range to focus its attacks on you.",
    "effect": "You provoke any target within Range to focus their attention on you.",
    "apCost": 1,
    "range": "Close",
    "actionType": "Turn"
  },
  {
    "name": "Tactical Retreat",
    "tree": "Tactical Warfare",
    "level": 2,
    "description": "Allow you and your allies to retreat safely to an adjacent Area.",
    "effect": "You use your tactical knowledge to provide you and your Allies cover to safely retreat.",
    "apCost": 2,
    "actionType": "Turn"
  },
  {
    "name": "Counterattack",
    "tree": "Tactical Warfare",
    "level": 3,
    "description": "Use as a reaction to make a single attack against the target that attacked you.",
    "effect": "When you are attacked you may activate this Ability to make a single attack of your choice against the target that attacked you.",
    "apCost": 3,
    "actionType": "Reaction"
  },
  {
    "name": "Critical Strike",
    "tree": "Advanced Soldier",
    "level": 1,
    "description": "Gain a ‘Nailed it’ result on attack rolls with a result of 19 - 20.",
    "effect": "You can identify points on an enemy that strike for the utmost amount of carnage.",
    "actionType": "Passive"
  },
  {
    "name": "Defy Death",
    "tree": "Advanced Soldier",
    "level": 2,
    "description": "When reduced to 0 SP activate as a Reaction to be reduced to 1 SP instead.",
    "effect": "You have the resilience and survival abilities to weather blows that would otherwise pulverise others into the dust.",
    "apCost": 3,
    "actionType": "Reaction"
  },
  {
    "name": "Whirlwind Strike",
    "tree": "Advanced Soldier",
    "level": 3,
    "description": "Make an attack against all targets in Range with an equipped weapon.",
    "effect": "You have learned to deliver a flurry of attacks against your foes.",
    "apCost": 3,
    "actionType": "Turn",
    "rollTable": {
      "19-20": "You strike all enemies within Range of the weapon, hitting them for double damage.",
      "11-18": "You hit all enemies within Range of the weapon.",
      "6-10": "You hit all enemies within Range of the weapon. Choose one: you deal half damage to all targets or you deal full damage, but your weapon is damaged after finishing the attack.",
      "2-5": "You hit one enemy in Range of the weapon, then your weapon is damaged.",
      "1": "Your attacks miss. You spin wildly and then collapse, falling Prone."
    }
  },
  {
    "name": "Omega Strike",
    "tree": "Legendary Soldier",
    "level": 1,
    "description": "Coordinate an attack against a single target. You and each of your allies makes a free attack.",
    "effect": "You coordinate a team wide attack against a target, working perfectly in unison to destroy those standing against you and your allies.",
    "apCost": "Variable",
    "actionType": "Turn"
  },
  {
    "name": "Steel Pact",
    "tree": "Legendary Soldier",
    "level": 1,
    "description": "Form a bond with a weapon. Gain an additional dice roll when attacking with that weapon.",
    "effect": "Choose a Weapon and Weapons System that you own.",
    "actionType": "Passive"
  },
  {
    "name": "Glanded Stims",
    "tree": "Cyborg",
    "level": 1,
    "description": "Gain additional actions on your turn, with the risk that you could cause yourself harm.",
    "effect": "Stim glands inserted into your adrenal veins allow you to push yourself beyond your normal means.",
    "apCost": 3,
    "actionType": "Free",
    "rollTable": {
      "20": "For the next 10 minutes you can take up to three actions on your turn or Push an action for free.",
      "11-19": "For the next 10 minutes you can take up to two actions on your turn or Push an action for free.",
      "6-10": "You can act twice this turn or Push an action for free.",
      "2-5": "Everything slows to a crawl. For the next 10 minutes you must choose between moving or taking an action on your turn. You also cannot Push rolls.",
      "1": "You overdose on stims, your HP is reduced to 0 and you must roll on the Critical Injury Table."
    }
  },
  {
    "name": "Modular Face Implant",
    "tree": "Cyborg",
    "level": 2,
    "description": "Install a Module interfaced directly to your brain.",
    "effect": "You undergo complex surgery allowing you to directly install a single Module into your cranium.",
    "actionType": "Passive"
  },
  {
    "name": "Bionic Endoskeleton",
    "tree": "Cyborg",
    "level": 3,
    "description": "You are now fully bionic, your HP is now SP.",
    "effect": "You undergo a complex and painful mechanical surgery that fully replaces all of your bones with a metal endoskeleton.",
    "actionType": "Passive"
  },
  {
    "name": "Meld Form",
    "tree": "Legendary Cyborg",
    "level": 1,
    "description": "You are now Meld. You can replicate Equipment and make Meld Tendril attacks.",
    "effect": "The Meld called to you from beyond the vast void of time and space.",
    "actionType": "Passive"
  },
  {
    "name": "Ascension",
    "tree": "Legendary Cyborg",
    "level": 1,
    "description": "You are now a virtual being. You control your Mech by wire, and can project your image holographically.",
    "effect": "You have explored the ways of the flesh to their full potential, and have found them lacking.",
    "actionType": "Passive"
  },
  {
    "name": "Field Fabrication",
    "tree": "Fabricator",
    "level": 1,
    "description": "Create Systems, Modules and Mech Chassis in the field.",
    "effect": "You are able to use your intimate knowledge of Mech fabrication techniques to craft Mech parts and even entire Chassis in the field.",
    "apCost": 1,
    "actionType": "Short"
  },
  {
    "name": "Miniaturised EMP",
    "tree": "Fabricator",
    "level": 2,
    "description": "Gain a mini-EMP that when activated shuts down all electronics in Close Range for 10 mins.",
    "effect": "You acquire and train in the use of a Miniaturised EMP that only you can use.",
    "apCost": 4,
    "range": "Close",
    "actionType": "Turn",
    "traits": [
      {
        "type": "pilot equipment"
      }
    ]
  },
  {
    "name": "Chassis Modder",
    "tree": "Fabricator",
    "level": 3,
    "description": "Modify your Mech Chassis to gain the Chassis Ability of another Mech in addition to its own.",
    "effect": "Your intense study and fascination with the core design of Mechs in their multiple forms allows you to modify a Mech Chassis to gain an array of abilities it was not initially designed for.",
    "actionType": "DownTime"
  },
  {
    "name": "System Miniaturisation",
    "tree": "Legendary Fabricator",
    "level": 1,
    "description": "Make Systems smaller to take up fewer slots and be usable as Pilot Equipment.",
    "effect": "Moore’s Law has become your life philosophy. Your talents at fabrication allow you to take even the bulkiest of Mech technology and scale it down to a portable size.",
    "actionType": "DownTime"
  },
  {
    "name": "Droned Mech Conversion",
    "tree": "Legendary Fabricator",
    "level": 1,
    "description": "Your Mech can be piloted remotely up to Far range.",
    "effect": "You install a complex array of electronic equipment, receivers, and transmitters into your Mech.",
    "actionType": "DownTime"
  },
  {
    "name": "Mecha Companion",
    "tree": "Ranger",
    "level": 1,
    "description": "Gain a robot familiar. It can be equipped with Systems and Modules.",
    "effect": "You have constructed a mechanical companion.",
    "traits": [
      {
        "type": "pilot equipment"
      }
    ]
  },
  {
    "name": "Snipe",
    "tree": "Ranger",
    "level": 2,
    "description": "Deal double damage on your next ranged weapon attack if it hits.",
    "effect": "You sharpen your senses, surpassing normal limits to pick off a target at Range.",
    "apCost": 3,
    "actionType": "Free"
  },
  {
    "name": "Infiltration",
    "tree": "Ranger",
    "level": 3,
    "description": "Sneak into compounds, settlements and arcos to perform acts of espionage.",
    "effect": "You are unrivalled at being able to infiltrate the most dangerous and well-guarded areas of the wastelands, and carry out acts of assassination, sabotage, or theft, or simply cause chaos, before slipping away unseen.",
    "apCost": 3,
    "actionType": "Long"
  },
  {
    "name": "Mecha Packmaster",
    "tree": "Legendary Ranger",
    "level": 1,
    "description": "Gain a second Mecha Companion in addition to your first.",
    "effect": "You have trained to be able to construct and control an additional Mecha Companion.",
    "traits": [
      {
        "type": "pilot equipment"
      }
    ]
  },
  {
    "name": "One with the Wastelands",
    "tree": "Legendary Ranger",
    "level": 1,
    "description": "Ask questions, gain favours and easily navigate the wastes.",
    "effect": "You have gained pure affinity with the wastelands offering you the following benefits.",
    "actionType": "Passive"
  },
  {
    "name": "Black Market",
    "tree": "Smuggler",
    "level": 1,
    "description": "Gain access to a range of contraband Systems, Modules, and Pilot Equipment.",
    "effect": "You are able to trade for various contraband and illegally acquired goods on the Black Market.",
    "actionType": "Passive"
  },
  {
    "name": "Pray I don’t alter the deal further...",
    "tree": "Smuggler",
    "level": 2,
    "description": "Retroactively change the terms of a deal you’ve agreed.",
    "effect": "You may retroactively alter a deal to change one element of it that the other party has to reluctantly agree to.",
    "apCost": 2,
    "actionType": "Turn"
  },
  {
    "name": "Hidden Stash",
    "tree": "Smuggler",
    "level": 3,
    "description": "Smuggle contraband into even the most secure areas.",
    "effect": "You are an expert at smuggling contraband into any place you desire.",
    "apCost": 3,
    "actionType": "Reaction"
  },
  {
    "name": "Knife Missile",
    "tree": "Legendary Smuggler",
    "level": 1,
    "description": "Gain a Knife Missile, a small floating assassination device you control.",
    "effect": "You acquire and train in the use of a Knife Missile that only you can use.",
    "apCost": 3,
    "range": "Far",
    "actionType": "Turn",
    "traits": [
      {
        "type": "pilot equipment"
      }
    ],
    "rollTable": {
      "20": "The target creature is killed, and any number of other target creatures within Close Range of the original target can also be killed if you desire.",
      "11-19": "The target creature is killed.",
      "6-10": "You can choose to kill the target creature, but if you do you are detected and your location is compromised.",
      "2-5": "The target narrowly avoids being killed, but is reduced to 0 HP and must roll on the Critical Injury Table.",
      "1": "The target avoids harm, your location is compromised, and you are detected and pursued."
    }
  },
  {
    "name": "Stealth Field Generator",
    "tree": "Legendary Smuggler",
    "level": 3,
    "description": "This makes you and everything in Close range invisible indefinitely.",
    "effect": "You acquire and train in the use of a Stealth Field Generator that only you can use.",
    "apCost": 4,
    "range": "Close",
    "actionType": "Turn",
    "traits": [
      {
        "type": "pilot equipment"
      }
    ]
  },
  {
    "name": "Union Representative",
    "tree": "Union Rep",
    "level": 1,
    "description": "Gain access to and ask questions about settlements and arcos.",
    "effect": "As a Union Rep you act as a liaison and representative between your Union Crawler and other organisations within the wastelands.",
    "actionType": "Passive"
  },
  {
    "name": "Union Call",
    "tree": "Union Rep",
    "level": 2,
    "description": "Direct other Pilots to carry out missions in exchange for a Scrap reward.",
    "effect": "As a Union Rep you can call upon the aid of other Pilots to support you in a variety of missions.",
    "actionType": "DownTime",
    "rollTable": {
      "20": "The mission is completed within a week. You pay the reward during Downtime.",
      "11-19": "The mission is completed within two weeks. You pay the reward during Downtime.",
      "6-10": "The mission will be completed within two weeks, but only if you pay twice the agreed reward during Downtime.",
      "2-5": "You wait two weeks and realise the mission is not completed. You may post the mission offer again or choose a different one.",
      "1": "The mission fails, and cannot be completed as something has gone badly wrong, for example, the target of an assassination attempt escapes and places a bounty on you instead, the trade caravan is destroyed, or the salvage is taken by a corpo or raider band instead."
    }
  },
  {
    "name": "Recruit",
    "tree": "Union Rep",
    "level": 3,
    "description": "Command an NPC follower who will assist you in your missions.",
    "effect": "You command an NPC who can understand and assist you.",
    "apCost": 4,
    "actionType": "Turn"
  },
  {
    "name": "VIP Beacon",
    "tree": "Legendary Union Rep",
    "level": 1,
    "description": "Place a distress beacon to call for aid, which arrives quickly and heavily armed.",
    "effect": "You can place a distress beacon down that will be answered within one hour.",
    "actionType": "Turn",
    "traits": [
      {
        "type": "uses",
        "amount": 1
      }
    ]
  },
  {
    "name": "Inspirational Union Leader",
    "tree": "Legendary Union Rep",
    "level": 3,
    "description": "Inspire your allies and refresh their HP, AP, and heal their minor injuries.",
    "effect": "You are a font of inspiration, courage, and stability for your Salvage Crew, in the face of the wasteland’s myriad dangers.",
    "actionType": "Turn",
    "traits": [
      {
        "type": "uses",
        "amount": 1
      }
    ]
  }
]
