[
  {
    "name": "Abilities",
    "description": "Refers to Pilot, Mech, and NPC Abilities such as those Bio-Titans have. Often activated by spending Ability Points or Energy Points respectively to produce a variety of effects in play. Pilot Abilities may be used in a Mech unless otherwise stated."
  },
  {
    "name": "Ability Points",
    "description": "Each Pilot has a number of Ability Points which they can use to trigger their Abilities in play. Ability Points restore fully after 1 week of rest during Downtime."
  },
  {
    "name": "Action Scene",
    "description": "Refers to any action packed situation in the game such as combat or chases where time is measured in Turns lasting roughly a minute each."
  },
  {
    "name": "Advanced Abilities",
    "description": "Refers to both the Advanced Class and Hybrid Abilities. Trained with 2 Training Points during Downtime."
  },
  {
    "name": "Advanced Tree",
    "description": "A Pilot that has specialised in their Core Class can take Abilities from the Advanced Tree of that Class. A Pilot can advance into their Advance Tree once they have taken 6 Core Abilities including all 3 Abilities linked to their Advanced Tree. For example the Engineer must take all 3 Abilities in the Mech-Tech tree before advancing into the Advanced Engineer Tree. Once they have chosen to advance into their Advanced Tree they can no longer choose to advance into either of their Hybrid Class options. They may still take all Abilities from their Core Class, such as the Engineer Abilities if they were an Engineer."
  },
  {
    "name": "Bio-Titan",
    "description": "Gigantic and terrifying mutated organisms formed of an amalgamation of mechanised flesh. They have a bizarre range of powers and adaptations that make them incredibly powerful foes to encounter. They can be salvaged for vast amounts of Bio-Titan Salvage when slain which can be sold as Tech 1 Scrap."
  },
  {
    "name": "Blind",
    "description": "If someone is Blind, they gain the Vulnerable Trait and cannot take any actions that would require sight unless they find another means to circumvent this."
  },
  {
    "name": "Core Abilities",
    "description": "The main Abilities that the 6 Core Classes gain access to. Trained with 1 Training Point during Downtime."
  },
  {
    "name": "Core Class",
    "description": "The 6 Core Pilot Classes of Salvage Union. Players play as one of these. Engineer, Hacker, Hauler, Salvager, Scout, Soldier."
  },
  {
    "name": "Corpo",
    "description": "The enemy. Refers both to the exploitative corporations who hold most of the power in the world and individuals who belong to or work for a Corpo."
  },
  {
    "name": "Creature",
    "description": "Broadly covers all people, animals, mutants and cyborgs in the game. Does not include Bio-Titans or Meld."
  },
  {
    "name": "Damaged",
    "description": "If a System, Module, or Chassis is damaged it is inoperable and cannot be used in any way until repaired and restored to the Intact Condition."
  },
  {
    "name": "Death Blow",
    "description": "A special type of attack made against a target in Close Range that is on 0 SP or HP or is otherwise incapacitated that kills or destroys them entirely."
  },
  {
    "name": "Destroyed",
    "description": "A destroyed System, Module, Chassis, or Vehicle is entirely inoperable. It cannot be repaired, salvaged, scrapped, or used in any way."
  },
  {
    "name": "Difficult Terrain",
    "description": "Any type of terrain that would be difficult to cross such as mountainous and hilly terrain, heavy swamp, or a thick forest. Movement over long distances through Difficult Terrain takes 2× as long. This does not apply in combat and action scenes though the Mediator may apply other penalties as appropriate."
  },
  {
    "name": "Downtime",
    "description": "A period of one week, typically spent on a Union Crawler. Used to restore all Mech and Pilot statistics, train new Abilities, craft and repair Mechs and move across the wasteland via the Crawler."
  },
  {
    "name": "Downtime Action",
    "description": "Actions that you can perform during your week of Downtime. Typically in your Union Crawler."
  },
  {
    "name": "Drone",
    "description": "Refers to all remotely controlled or automated mechanical Drones. Treat Drones as Mechs for the purpose of the rules and Abilities."
  },
  {
    "name": "Energy Points",
    "description": "Each Mech has an Energy Point value representing the output of its reactor. These are spent to activate a wide range of Abilities. Energy Points restore fully after 1 week of Downtime in a Mech Bay of the Tech Level of the Mech or higher."
  },
  {
    "name": "Environmental Effects",
    "description": "Environmental effects include heat and cold, heavy rain, radiation storms, high winds and flooding. These can cause a variety of negative effects in play as decided by the Mediator."
  },
  {
    "name": "Free Action",
    "description": "A simple action like talking which does not take up much time in a round and can be done for free."
  },
  {
    "name": "Group",
    "description": "The Pilots and their Mechs count as a group and will often be referred to as such. Any allied group counts as a group as well. During Group Initiative, play switches between different groups."
  },
  {
    "name": "Heat",
    "description": "Generates on your Mech when you perform various tasks. When you reach your Heat Capacity you must make a Heat Check. If you start your turn at your Heat Capacity you must also make a Heat Check."
  },
  {
    "name": "Heat Check",
    "description": "To make a Heat Check you roll a d20. If the result is equal to or under your current Heat you must roll on the Reactor Overload Table. A roll of a 20 is always a success, as your Heat Capacity can be higher than 20."
  },
  {
    "name": "Hit Points",
    "description": "How resilient your Pilot, a creature, or a person is. When your Pilot is reduced to 0 HP they must roll on the Critical Injury Table. NPCs typically die at 0 HP. Any attack that deals SP damage deals 2× that amount to anything that has a Hit Point value."
  },
  {
    "name": "Hybrid Classes",
    "description": "A Pilot that has specialised in multiple roles. A Pilot can advance into a Hybrid Class once they have taken 6 Core Abilities, including all 3 Abilities linked to the Hybrid Class they have chosen. For example the Engineer must take all 3 Abilities in the Forging Tree before advancing into the Fabricator Class. Once a Pilot has chosen their Hybrid Class they cannot advance into any other Hybrid Class or Advanced Tree. They also can no longer choose Abilities from their Core Class that their Hybrid Class cannot learn. For example if the Engineer advances into the Fabricator Class they cannot take any Abilities from the Mech-Tech Tree, though they can retain any Abilities they have previously picked from that tree."
  },
  {
    "name": "Incapacitated",
    "description": "If a creature is incapacitated it is unconscious and typically on 0 HP. A death blow can be performed upon an incapacitated creature."
  },
  {
    "name": "Inoperable",
    "description": "If a System, Module, Chassis, Vehicle, or Pilot Equipment is inoperable it cannot be used in any way. Mechs and Vehicles cannot be piloted, weapons cannot be used to make attacks, and no Abilities can be activated. This typically applies when damaged, but some effects will also make things inoperable."
  },
  {
    "name": "Intact",
    "description": "If a System, Module, Chassis, Vehicle, or Pilot Equipment has the Intact Condition, it is in full working order and can be used normally."
  },
  {
    "name": "Integrated",
    "description": "If a System or Module is integrated into a Mech Chassis it comes as part of it. It does not take up any additional System or Module Slots and cannot be removed, replaced or fitted on another Mech. It can still be targeted with any Ability that would target a System or Module. If damaged or destroyed it can be repaired or restored by any effect that would Repair the Chassis. Use the Tech Level and Salvage Value of the Chassis for any such Abilities."
  },
  {
    "name": "Irradiated",
    "description": "An area that’s Irradiated puts strain on Mech reactors, causes wildlife to wither and die, blights soil and causes untold damage to humans and animals in the area. Mechs in an irradiated area increase their Heat by 1 every hour they are within it. Pilots exposed in an irradiated area can suffer bloody vomit, internal bleeding, fever, infection, and eventually death, gaining a Major Injury every day they are exposed. Radiation storms are significantly more likely to occur in Irradiated areas and Bio-Titans and mutants are likely to be found within the area. This effect lasts in the area for at least 1 to 5 years. In extreme cases the area can be irradiated for 1,000 to 20,000 years."
  },
  {
    "name": "Lance",
    "description": "A formation of four Mechs, typically referred to in the context of combat."
  },
  {
    "name": "Legendary Abilities",
    "description": "Powerful, end game, Abilities that a Core Class and Hybrid Class gains access to once they have trained in 6 Core Abilities and 3 Advanced Abilities. Trained with 3 Training Points during Downtime."
  },
  {
    "name": "Long Action",
    "description": "An action that takes an hour to complete. This includes actions such as area salvaging as well as many Systems, Modules, and Abilities. It is also the length needed to fully Shutdown a Mech and reduce its Heat to 0."
  },
  {
    "name": "Major Injury",
    "description": "A significant injury such as broken bones, permanent scarring, deep burns or cranial fractures. Your Max Health is permanently reduced by 2 until healed during Downtime in a Tech 5-6 Med Bay."
  },
  {
    "name": "Mech",
    "description": "A walking, armoured, and often armed mechanical construct that can be piloted. You will spend much of the game controlling one of these."
  },
  {
    "name": "Meld",
    "description": "The Meld are an intelligent, alien, nanite entity that can take over creatures and machines. Can be Salvaged for Meld Nanites."
  },
  {
    "name": "Minor Injury",
    "description": "A simple injury such as a scar, burn, or laceration. Your Max Hit Points are permanently reduced by 1 until healed during Downtime in a Tech 3-4 Med Bay."
  },
  {
    "name": "Module",
    "description": "An internal part such as a communicator, hacking chip, or coolant flow manifold that inserts into a Mech."
  },
  {
    "name": "Module Slots",
    "description": "The total number of Modules a Mech can install. Also the number of Modules a Module takes up on a Mech."
  },
  {
    "name": "Morale",
    "description": "The will of an NPC to stay engaged in combat or dangerous situations. NPCs make Morale Checks by rolling on the Morale Table when they are injured, or see their allies hurt. This can cause them to retreat or surrender. Player Pilots never roll morale and must decide themselves whether they fight or flee in a situation."
  },
  {
    "name": "Mount / Dismount",
    "description": "Mounting and Dismounting are actions that Mechs and Pilots can perform if they have access to a System or Module with the Rigging Trait. This lets them remove and attach Systems and Modules to a Mech. You may not Mount a damaged System or Module to a Mech."
  },
  {
    "name": "Move",
    "description": "Refers to moving from one Range Band to another. E.g. from Medium Range to Long Range. Can be done once during your turn by default."
  },
  {
    "name": "Operable",
    "description": "If a System, Module, Chassis, Vehicle, or Pilot Equipment is operable it can be used, piloted, used to make an attack, and any of its Abilities can be activated as normal."
  },
  {
    "name": "Passive",
    "description": "Denotes that a System, Module, Pilot Equipment or Ability is used passively, often refers to things that increase a stat such as the Capacitance Bank System or are always assumed active such as a Locomotion System."
  },
  {
    "name": "People",
    "description": "People are any human or human-like beings in the game such as wasters, cyborgs, and salvagers."
  },
  {
    "name": "Pilot",
    "description": "Refers typically to the player’s Pilot character who controls their Mech. Can also refer to NPC Pilots in the world."
  },
  {
    "name": "Pilot Equipment",
    "description": "Gear and personal items that Pilots carry. Each takes up 1 Inventory Slot."
  },
  {
    "name": "Prone",
    "description": "If something is Prone it has fallen over, been knocked down, and is on the ground. It gains the Immobile and Vulnerable Traits. It takes a Turn Action to get up from being prone."
  },
  {
    "name": "Push",
    "description": "You may choose to Push your Mech after you roll the die. This allows you to re-roll the die, but you must accept the second result. Your Mech then increases its Heat by 2 and must make a Heat Check. If you Push ‘for free’ you may re-roll the die without adding Heat or making a Heat Check. Pilots cannot Push rolls and roll the die once for all actions, unless otherwise noted."
  },
  {
    "name": "Range",
    "description": "The Range of a System, Module, Ability, or Pilot Equipment. Splits into Close Range, Medium Range, Long Range, and Far Range. Ranges in Salvage Union are intended to be relative."
  },
  {
    "name": "Ranged Weapon",
    "description": "Any weapon that does not have the Melee Trait and is used to make some sort of Ranged based attack counts as a Ranged weapon."
  },
  {
    "name": "Reaction",
    "description": "A type of action typically done in response to something such as activating a shield when getting hit or attempting to escape from a Mech when it is destroyed. A Player may always choose to use a Reaction System, Module, or Ability as a Turn Action instead if they wish."
  },
  {
    "name": "Retreat",
    "description": "Pilots and NPCs can use the Retreat Ability during an Action Scene to flee from a combat or dangerous situation as a group. This involves rolling on the Retreat Table to find out what happens."
  },
  {
    "name": "Round",
    "description": "A Round is over in an action scene when every character in the scene has taken a turn. Play then passes to the next round."
  },
  {
    "name": "Salvage Value",
    "description": "Each Mech, System, and Module has a Salvage Value represented by this symbol. This value determines the following: The amount of Salvage you get when you perform the Scrap action on a Chassis, System, Module, Vehicle, or Bio-Titan. The amount of Scrap you need to use of its Tech Level or higher to repair a damaged Chassis, System, or Module. The amount of Cargo Slots a System, Module, or Chassis takes up on a Mech."
  },
  {
    "name": "Scrap",
    "description": "Scrap is an abstract representation of the wide array of components that can be salvaged in the wastelands. They can include semiconductors, wiring looms, titanium alloys, and more, but the name is only there to provide in-game flavour. There are six Tech Levels of Scrap broadly representing the rarity, value, and complexity of the components. Scrap is used as a form of barter based currency and can be used to craft and repair Mech Chassis, Systems, and Modules. Scrap takes up 1 Cargo Slot on a Mech and 3 Inventory Slots on a Pilot."
  },
  {
    "name": "Setback",
    "description": "A consequence that can occur as a result of Pilot actions, rolling a Tough choice or when The Mediator decides. Can include taking damage, Systems or Modules being damaged, allies refusing to work with you, being attacked, gaining Heat or wasting an hour of time. A Severe Setback is a harsher version of this with more extreme consequences."
  },
  {
    "name": "Severe Environmental Effects",
    "description": "Severe environmental effects include extreme heat and cold, solar storms, firestorms, hailstorms, tsunamis, acid rain, hurricanes and tornadoes. These all have a variety of severely negative effects in play as decided by the Mediator."
  },
  {
    "name": "Short Action",
    "description": "An action that takes about 10 minutes to complete and is typically used outside of action scenes."
  },
  {
    "name": "Shutdown",
    "description": "A Mech that is Shutdown is inoperable and gains the Vulnerable Trait. It cannot be used in any way. If a Mech is Shutdown fully for an hour, it reduces its Heat to 0. A Pilot can activate a Shutdown Mech as a Turn Action. It takes a Mech a Turn to boot up from Shutdown and it will be active at the start of that Pilots next Turn."
  },
  {
    "name": "Squad",
    "description": "Groups of NPCs are collected into Squads for ease of use and tracking in play. These have higher HP and do more damage than individual units and often have multiple attacks."
  },
  {
    "name": "Structure Points",
    "description": "How resilient to damage a Mech, Vehicle, or Bio-Titan is. When this reaches 0, you must roll on the Critical Damage Table to find out what happens to your Mech. NPCs are typically damaged or destroyed at 0 SP. If something has Structure Points, any attack that deals HP damage deals half damage to it instead. Vehicles, Bio-Titans, Drones, and many other tough creatures have Structure Points as well and this applies to them too."
  },
  {
    "name": "System",
    "description": "An external part such as a weapon, arm, or tool that attaches to a Mech."
  },
  {
    "name": "System Slots",
    "description": "The total number of Systems a Mech can mount. Also the number of System Slots a System takes up on a Mech."
  },
  {
    "name": "Tech Level",
    "description": "How technologically advanced a Mech Chassis, System, Module, Vehicle, or Pilot Equipment is, as well as a determination of the value of Scrap."
  },
  {
    "name": "Turn",
    "description": "A turn is a unit of measurement during action scenes within the game. During a turn a Mech, Pilot, or NPC can move a Range band in any direction and take a Turn Action such as making an attack or using certain Abilities."
  },
  {
    "name": "Turn Action",
    "description": "An action that takes around a minute to complete and can be done once in a standard turn."
  },
  {
    "name": "Turrets",
    "description": "Static form of automated or manned defence. Unless otherwise stated Turrets have the Immobile Trait and deal damage as their Weapon System. They have SP equal to 2× their Weapon Systems Tech Level, for example a Green Laser Turret has 4 SP and attacks as a Green Laser."
  },
  {
    "name": "Union Crawler",
    "description": "A large Mech which is home to an entire community of salvagers and is capable of deploying Mechs. It has a range of facilities split into Bays which enable a wide range of actions such as training Abilities and gathering rumours and requires Upkeep to keep functioning."
  },
  {
    "name": "Vehicle",
    "description": "Any non-Mech mechanical transport that can be driven or piloted is counted as a vehicle. This includes the likes of cars, power loaders, trucks, tanks, and helicopters."
  },
  {
    "name": "Weapons System",
    "description": "A Weapons System is any System that has an explicit damage value within its stat block. For example, a Green Laser, Missile Pod, or a Heavy Duty Mining Rig. All Weapons Systems require a Turn Action to activate unless stated otherwise."
  },
  {
    "name": "Wheeled",
    "description": "If something is wheeled it moves via use of wheels. Wheeled vehicles cannot cross areas of Difficult Terrain and can only be used effectively on roads or other flat expanses, few of which exist in the wastelands."
  }
]
