[
  {
    "name": "Core Mechanic Table",
    "section": "core",
    "rollTable": {
      "1": "Cascade Failure: Something has gone terribly wrong. You suffer a severe consequence of the Mediator’s choice. When attacking, you miss the target and suffer a Setback chosen by the Mediator.",
      "20": "Nailed it: You have overcome the odds and managed an outstanding success. You may achieve an additional bonus of your choice to the action. When dealing damage, you can choose to double it or pick another appropriate bonus effect.",
      "11-19": "Success: You have achieved your goal without any compromises. When attacking, you hit the target and deal standard damage.",
      "6-10": "Tough Choice: You succeed in your action, but at a cost. The Mediator gives you a Tough Choice with some kind of Setback attached. When attacking, you hit, but must make a Tough Choice.",
      "2-5": "Failure: You have failed at what you were attempting to do. You face a Setback of the Mediator’s choice. When attacking, you miss the target."
    }
  },
  {
    "name": "Group Initiative Table",
    "section": "action scene",
    "rollTable": {
      "1": "Ambush: Two NPCs chosen by the Mediator act first. Play then passes to the player group and one Pilot is chosen by the players to act next.",
      "20": "You Shot First: Two Pilots chosen by the players act first. Play then passes to the NPC group and one NPC chosen by the Mediator acts next.",
      "11-19": "Quickdraw: One Pilot chosen by the players acts first. Play then passes to the NPC group and one NPC chosen by the Mediator acts.",
      "6-10": "Wait and See: One NPC chosen by the players acts first. Play then passes to the player group and one Pilot chosen by the players acts.",
      "2-5": "Fumble: One NPC chosen by the Mediator acts first. Play then passes to the player group and one Pilot chosen by the players acts."
    }
  },
  {
    "name": "Critical Injury Table",
    "section": "damage",
    "rollTable": {
      "1": "Fatal Injury: Your Pilot suffers a fatal injury and dies.",
      "20": "Miraculous Survival: You survive against the odds. You have 1 HP, remain conscious and can act normally.",
      "11-19": "Unconscious: You are stable at 0 HP, but unconscious and cannot move or take actions until you gain at least 1 HP. You will regain consciousness naturally in 1 hour and get back up with 1 HP.",
      "6-10": "Minor Injury: You suffer a Minor Injury such as a sprain, burns, or minor concussion. Your Max HP is reduced by 1 until healed in a Tech 3-4 Med Bay. In addition, you are Unconscious. Apply the result of 11-19.",
      "2-5": "Major Injury: You suffer a Major Injury such as permanent scarring, broken ribs, or internal injuries. Your Max HP is reduced by 2 until healed in a Tech 5-6 Med Bay. In addition, you are Unconscious. Apply the result of 11-19."
    }
  },
  {
    "name": "Critical Damage Table",
    "section": "damage",
    "rollTable": {
      "1": "Catastrophic Damage: The Mech, as well as any mounted Systems and Modules as well as all Cargo, is destroyed. Your Pilot dies unless they have a means to escape the Mech.",
      "20": "Miraculous Survival: Your Mech is somehow Intact. It has 1 SP and is still fully operational. Your Pilot is unharmed.",
      "11-19": "Core Damage: Your Mech Chassis is damaged and inoperable until repaired. All mounted Systems and Modules remain Intact. Your Pilot is reduced to 0 HP unless they have some means to escape the Mech.",
      "6-10": "Module Destruction: A Module mounted on your Mech is destroyed. This is chosen by the Mediator or at random. Your Mech Chassis is damaged and inoperable until repaired. Your Pilot is unharmed.",
      "2-5": "System Destruction: A System mounted on your Mech is destroyed. This is chosen by the Mediator or at random. Your Mech Chassis is damaged and inoperable until repaired. Your Pilot is unharmed."
    }
  },
  {
    "name": "Reactor Overload Table",
    "section": "heat",
    "rollTable": {
      "1": "Reactor Overload: Your Mech’s reactor goes into full meltdown and explodes. Your Mech, as well as any mounted Systems, Modules, and all Cargo, is destroyed in the explosion. Everything in Close Range of your Mech takes SP damage equal to your Mech’s Maximum Heat Capacity. They may take any Turn Action or Reaction in response to try to avoid this. Your Pilot dies unless they have a means to escape. The area your Mech was in becomes Irradiated",
      "20": "Reactor Overdrive: Your Mech’s reactor goes into overdrive. Your Mech can take any additional action this turn or Push their next roll within 10 minutes for free.",
      "11-19": "Reactor Overheat: Your Mech’s reactor has overheated. Your Mech shuts down and gains the Vulnerable Trait. Your Mech will re-activate at the end of your next turn. In addition, your Mech takes an amount of SP damage equal to your current Heat.",
      "6-10": "Module Overload: One of your Mech’s Modules chosen at random or by the Mediator is destroyed.",
      "2-5": "System Overload: One of your Mech’s Systems chosen at random or by the Mediator is destroyed."
    }
  },
  {
    "name": "Area Salvage Table",
    "section": "salvaging",
    "rollTable": {
      "1": "Nothing: You find nothing in this area.",
      "20": "Jackpot!: You find a Mech Chassis, System, or Module at the Tech Level of the area. It is in the Damaged Condition. This can be randomised or chosen by the Mediator.",
      "11-19": "Winning: You find 3 Scrap of the Tech Level of the area.",
      "6-10": "Not Bad: You find 2 Scrap of the Tech Level of the area.",
      "2-5": "Better than Nothing: You find 1 Scrap of the Tech Level of the area."
    }
  },
  {
    "name": "Mech Salvage Table",
    "section": "salvaging",
    "rollTable": {
      "1": "Ashes and Dust: The Mech is unsalvageable: its Chassis, Systems and Modules are all considered destroyed.",
      "20": "Lions Share: You salvage the Mech Chassis, a System and a Module of your choice mounted on it. They both have the Damaged Condition. Anything else is considered destroyed.",
      "11-19": "Meat and Potatoes: You salvage the Mech Chassis or a System or Module of your choice mounted on it. It has the Damaged Condition. Anything else is considered destroyed.",
      "6-10": "Bits and Pieces: You salvage a System or Module of your choice mounted on the Mech. It has the Damaged Condition. Anything else is considered destroyed.",
      "2-5": "Nuts and Bolts: You salvage half of the Salvage Value of the Mech Chassis in Scrap of its Tech Level, to a minimum of 1. Everything else is considered destroyed."
    }
  },
  {
    "name": "Reaction Roll Table",
    "section": "npc tables",
    "rollTable": {
      "1": "Actively Hostile: The NPCs will launch an attack on the group if appropriate or flee from them, barricade themselves in, and avoid contact as though they were hostile.",
      "20": "Actively Helpful and Friendly: The NPCs are incredibly friendly and positive towards the group and will actively help them in any reasonable way they can.",
      "11-19": "Friendly: The NPCs are friendly and willing to talk, trade, and offer information to the group; however, they will still ask for their fair share in return.",
      "6-10": "Unfriendly: The NPCs react in an unfriendly manner to the group; they are difficult to talk or trade with and reluctant to offer any help to the Pilots.",
      "2-5": "Hostile: The NPCs are actively hostile to the group. They will defend their area, make motions to attack, gesture and threaten, and be unwilling to help in any way."
    }
  },
  {
    "name": "NPC Action Table",
    "section": "npc tables",
    "rollTable": {
      "1": "Cascade Failure: The NPC has catastrophically failed at their action. They suffer a Severe Setback of the player’s choice. A weapon attack misses, with a Severe Setback chosen by the players.",
      "20": "Nailed It: The NPC succeeds spectacularly at their action. They get an additional bonus of the Mediator’s choice. If they are making an attack, they hit, and do double damage or get another bonus of the Mediator’s choice.",
      "11-19": "Success: The NPC achieves their action successfully. An attack hits and deals standard damage.",
      "6-10": "Tough Choice: The NPC is successful, but faces a Tough Choice. The players give the Mediator a choice between two Setbacks. In combat, a weapon attack hits, but with a choice of Setback chosen by the players.",
      "2-5": "Failure: The NPC has failed at their action. The players choose an appropriate Setback for failure. In combat, a weapon attack misses."
    }
  },
  {
    "name": "Morale Table",
    "section": "npc tables",
    "rollTable": {
      "1": "Surrender: The NPCs surrender to whoever is attacking them. If there is nobody to surrender to, they will recklessly flee.",
      "20": "Fight to the Death: The NPCs see this one through to the end. They hunker down and will not retreat from this fight under any circumstance.",
      "11-19": "Keep Fighting: The NPCs continue to fight this one out for now.",
      "6-10": "Fighting Retreat: The NPCs retreat, but do so whilst continuing to fight. They will fight for one more round and then retreat.",
      "2-5": "Retreat: The NPCs flee the fight as quickly and safely as possible."
    }
  },
  {
    "name": "Retreat Table",
    "section": "npc tables",
    "rollTable": {
      "1": "Disastrous Escape: The group retreat to an adjacent location of their choice within the Region Map, but at a severe cost. They suffer a Severe Setback and may be pursued.",
      "20": "Perfect Escape: The group makes a perfect escape from the situation to any location of their choice within the Region Map and cannot be pursued.",
      "11-19": "Escape: The group makes a safe escape from the situation to any adjacent location of their choice within the Map and cannot be pursued.",
      "6-10": "Dangerous Escape: The group escapes to any adjacent location of their choice within the Region Map, but at a cost. They must make a Tough Choice related to the situation.",
      "2-5": "Failed Escape: The group fails to retreat from the situation and are pinned down. They cannot retreat and must fight it out to the end."
    }
  }
]